app/views/personal_data/_personal_data.html.slim


      - if personal_data.employments.any?
---
SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67)
SELECT 1 AS one FROM `employments` WHERE `employments`.`personal_data_id` = 60 LIMIT 1

          tbody
            - personal_data.employments.each do |employment|
---
SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` = 60