app/controllers/personal_data_controller.rb

SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47)
SELECT `personal_data`.* FROM `personal_data`
---
  def index
    @personal_data = PersonalData.includes(:employments).all

INSERT INTO `personal_data` (`first_name`, `last_name`, `nickname`, `email`, `phone_number`, `created_at`, `updated_at`) VALUES ('shubham', 'tiwari', 'shubh', '113cs29@gmail.com', '334-243-5345', '2023-10-04 11:28:36.192816', '2023-10-04 11:28:36.192816')
---
  def create
    @personal_data = PersonalData.new(personal_data_params)
    respond_to do |format|
      if @personal_data.save

SELECT `personal_data`.* FROM `personal_data` WHERE `personal_data`.`id` = 48 LIMIT 1
---
    def set_personal_data
      @personal_data = PersonalData.find(params[:id])